In [ ]:
#Loops

numbers = [1,2,3,4,5]   #List of numbers
for number in numbers:  #loop
    print(number)

In [ ]:
numbers = [1,2,3,4,5]
for i in range(1,6):
    print(i)
print(numbers)

In [ ]:
simpsons = {'Dad':'Homer', #This is a Tuple
            'Mum':'Marge',
            'Baby':'Maggie'}

for k, v in simpsons.items():
    print(f'{v} is the {k}')

In [5]:
foods = {'Fruit':'Grapes',
        'Vegetable':'Potato',
        'Fish':'Herring'}

for k, v in foods.items():
    print(f'My favourite {k} is {v}')

My favourite Fruit is Grapes
My favourite Vegetable is Potato
My favourite Fish is Herring

In [11]:
side_characters = ['Barney','Ned','Krusty','Sideshow Bob']

for i, name in enumerate(side_characters):
    side_characters[i] = f'{name} Simpson'

print(side_characters)

['Barney Simpson', 'Ned Simpson', 'Krusty Simpson', 'Sideshow Bob Simpson']

In [ ]:
import pandas as pd
df_1 = pd.DataFrame({'col 1':['food','bar','baz'],
                     'col 2': [1,2,3]})
df_2 = pd.DataFrame({'col 1':['Thing 1','Thing 2','Thing 3'],
                    'col 2': ['Green', 'Eggs', 'Ham'] })

df_dict = {'Dataframe 1':df_1,
           'Dataframe 2':df_2}

print(df_dict.items())
for k, v in df_dict.items():
    print(k)
    print(v)

for k, v in df_dict.items():
    v['originator'] = k

df_dict['Dataframe 1']

In [20]:
company_1 = pd.DataFrame({'Employee':['Mike','Paul','Liz'],
                     'Job Title': ['Chief Executive','Research Analyst', 'Head of Service']})
company_2 = pd.DataFrame({'Employee':['Anne','Kate','Bob'],
                     'Job Title': ['Sales Rep','Marketing Director', 'Website Designer']})

companies_dict = {'Company 1':company_1,
                'Company 2':company_2}

for k, v in companies_dict.items():
    v['originator'] = k
    
companies_dict['Company 1']

  Employee         Job Title originator
0     Mike   Chief Executive  Company 1
1     Paul  Research Analyst  Company 1
2      Liz   Head of Service  Company 1

In [21]:
child_identifiers = pd.DataFrame({'child_id': ['child1','child2','child3','child4'],
              'age_first_contact':[6, 10, 12, 13],
              'gender':['M','M','M','F']})
print(child_identifiers)
nhs_nums = pd.DataFrame({'child_id': ['child1','child2','child3','child4'],
              'nhs_num':['nhs1','nhs2', 'nhs3', 'nhs4']})

#print(nhs_nums)
ident_nhs = child_identifiers.merge(nhs_nums, how='left', left_on='child_id', right_on='child_id')

#ident_nhs = child_identifiers.merge(nhs_nums, how='left',on='child_id')

print(ident_nhs)

  child_id  age_first_contact gender
0   child1                  6      M
1   child2                 10      M
2   child3                 12      M
3   child4                 13      F
  child_id  age_first_contact gender nhs_num
0   child1                  6      M    nhs1
1   child2                 10      M    nhs2
2   child3                 12      M    nhs3
3   child4                 13      F    nhs4

In [25]:
cp_plans = pd.DataFrame({'child_id': ['child1','child4'],
              'cp_start_date':['01/01/2019','01/01/2000']
             })

df_left = ident_nhs.merge(cp_plans, how='left', on='child_id')
print(df_left)

#df_left['cp_start_date'] = df_left['cp_start_date'].fillna()
#df_inner = ident_nhs.merge(cp_plans, how='inner', on='child_id')
#print(df_inner)

  child_id  age_first_contact gender nhs_num cp_start_date
0   child1                  6      M    nhs1    01/01/2019
1   child2                 10      M    nhs2           NaN
2   child3                 12      M    nhs3           NaN
3   child4                 13      F    nhs4    01/01/2000
  child_id  age_first_contact gender nhs_num cp_start_date
0   child1                  6      M    nhs1    01/01/2019
1   child4                 13      F    nhs4    01/01/2000

In [33]:
employee_dict = pd.DataFrame(
        {'name':['mike jones','john smith','jim carr','paul carter'],
        'salary':[45000,60000,25000,37500],
        'job title':['senior analyst','research analyst','performance analyst','GIS Analyst']})

employee_id_dict = pd.DataFrame(
        {'name':['mike jones','john smith','jim carr','paul carter'],
        'emp_id':[123456,123457,123458,123459]}
)

emp_table = employee_dict.merge(employee_id_dict, how='left', on='name')
emp_table

          name  salary            job title  emp_id
0   mike jones   45000       senior analyst  123456
1   john smith   60000     research analyst  123457
2     jim carr   25000  performance analyst  123458
3  paul carter   37500          GIS Analyst  123459

In [6]:
import pandas as pd
dict_child = pd.DataFrame({
    'ChildID':['child1','child2','child3','child4'],
    'Gender':['0','1','2','7'],
    'DOB': ['05/05/2015','12/12/2020','01/01/2000','09/12/2017'],
    'Ethnicity': ['BANG','WOTH','MOTH','WIRI'],
    'Place': ['B1', 'T1', 'X2', 'W1'],
})
dict_child['DOB'] = pd.to_datetime(dict_child['DOB'], format='%d/%m/%Y', dayfirst=True)
print(dict_child)

  ChildID Gender        DOB Ethnicity Place
0  child1      0 2015-05-05      BANG    B1
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2
3  child4      7 2017-12-09      WIRI    W1

In [12]:
child_info = ([{'Child_ID':'child1',
                            'Gender': '0',
                            'DOB': '05/05/202015',
                            'Ethnicity': 'BANG',
                            'Place' : 'B1'
                            },
                            {'Child_ID':'child2',
                            'Gender': '1',
                            'DOB': '12/12/2020',
                            'Ethnicity': 'WOTH',
                            'Place' : 'T1'
                            },{'Child_ID':'child3',
                            'Gender': '2',
                            'DOB': '01/01/2000',
                            'Ethnicity': 'MOTH',
                            'Place' : 'x2'
                            },{'Child_ID':'child4',
                            'Gender': '7',
                            'DOB': '09/12/2017',
                            'Ethnicity': 'WIRI',
                            'Place' : 'W1'
                            }])

dict_child['DOB'] = pd.to_datetime(dict_child['DOB'], format='%d/%m/%Y', dayfirst=True)
print(dict_child)

  ChildID Gender        DOB Ethnicity Place
0  child1      0 2015-05-05      BANG    B1
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2
3  child4      7 2017-12-09      WIRI    W1

In [10]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'CEO'},
                {'Name':'Naiomi LP',
                'Salary':'90000',
                'Job Title':'VP'},
                {'Name':'Luke V',
                'Salary':'45000',
                'Job Title':'Teach Lead'},
                {'Name':'Matt K',
                'Salary':'30000',
                'Job Title':'Comms'},
                {'Name':'Hannah K',
                'Salary':'38000',
                'Job Title':'HR'},]

corp_df = pd.DataFrame(corporation)


corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df['Salary'] = corp_df['Salary'].astype('int')

corp_df

        Name  Salary   Job Title Date Started
0    Will LP   10000    Employee   1993-12-05
1   Annie LP   15000         CEO   2000-01-01
2  Naiomi LP   90000          VP   2020-01-01
3     Luke V   45000  Teach Lead   1989-12-23
4     Matt K   30000       Comms   2010-10-10
5   Hannah K   38000          HR   2021-12-17

In [16]:


print(selection)
mask = corp_df['Salary']> 40000
over_40k = corp_df[mask]
under_40k = corp_df[~mask]
over_40k
under_40k

0    False
1    False
2     True
3     True
4    False
5    False
Name: Salary, dtype: bool

       Name  Salary Job Title Date Started
0   Will LP   10000  Employee   1993-12-05
1  Annie LP   15000       CEO   2000-01-01
4    Matt K   30000     Comms   2010-10-10
5  Hannah K   38000        HR   2021-12-17

In [27]:
ceo_df = corp_df[corp_df['Job Title'] == 'CEO']
ceo_df

not_ceo_df = corp_df[corp_df['Job Title'] != 'ceo']
not_ceo_df

nepo_df = corp_df[corp_df['Name'].str.contains('LP')]
nepo_df

some_jobs_df = corp_df[corp_df['Job Title'].isin({'Teach Lead', 'CEO', 'VP'})]
some_jobs_df

some_jobs_df = corp_df[corp_df['Job Title'].isin({'Cleaner', 'Site Manager'})]
some_jobs_df

Empty DataFrame
Columns: [Name, Salary, Job Title, Date Started]
Index: []

In [44]:
dict_child = pd.DataFrame({
    'ChildID':['child1','child2','child3','child4'],
    'Gender':['0','1','2','7'],
    'DOB': ['05/05/2015','12/12/2020','01/01/2000','09/12/2017'],
    'Ethnicity': ['BANG','WOTH','MOTH','WIRI'],
    'Place': ['B1', 'T1', 'X2', 'W1'],
})

dict_child['DOB'] = pd.to_datetime(dict_child['DOB'], format='%d/%m/%Y', dayfirst=True)
print(dict_child)
print("\n")

# gender_err = child_info[child_info['Gender'] == '7']
# gender_err

# not_gender_err = child_info[child_info['Gender'] != '7']
# not_gender_err

mask = dict_child['Gender'] == '7'
wrong_gender_codes = dict_child[mask]
print(wrong_gender_codes)
print("\n")

correct_gc = dict_child[~mask]
print(correct_gc)
print("\n")

incorrect_eth = dict_child[dict_child['Ethnicity'] == 'BANG']
print(incorrect_eth)
print("\n")

correct_eth = dict_child[dict_child['Ethnicity'] != 'BANG']
print(correct_eth)
print("\n")

df = dict_child
# df['Ethnicity'] = df['Ethnicity'].str.lower()
# df

moth__woth = df[df['Ethnicity'].str.lower().isin(['moth','woth'])]
moth__woth

  ChildID Gender        DOB Ethnicity Place
0  child1      0 2015-05-05      BANG    B1
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2
3  child4      7 2017-12-09      WIRI    W1


  ChildID Gender        DOB Ethnicity Place
3  child4      7 2017-12-09      WIRI    W1


  ChildID Gender        DOB Ethnicity Place
0  child1      0 2015-05-05      BANG    B1
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2


  ChildID Gender        DOB Ethnicity Place
0  child1      0 2015-05-05      BANG    B1


  ChildID Gender        DOB Ethnicity Place
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2
3  child4      7 2017-12-09      WIRI    W1

  ChildID Gender        DOB Ethnicity Place
1  child2      1 2020-12-12      WOTH    T1
2  child3      2 2000-01-01      MOTH    X2

In [45]:
#Making a list in a loop
x = 1
numbers_list = []
for i in list(range(10)):
    numbers_list.append(x)
    x = (x + numbers_list[i - 1])
print(numbers_list)

[1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

In [49]:
#Loops inside loops
answers = []
times_tables = {}
for i in list(range(1,11)):
    for j in list(range(1,11)):
        answers.append(i * j)
    times_tables[i] = answers
    answers = []

multiplication_table = pd.DataFrame(times_tables)
multiplication_table.index += 1
multiplication_table

    1   2   3   4   5   6   7   8   9    10
1    1   2   3   4   5   6   7   8   9   10
2    2   4   6   8  10  12  14  16  18   20
3    3   6   9  12  15  18  21  24  27   30
4    4   8  12  16  20  24  28  32  36   40
5    5  10  15  20  25  30  35  40  45   50
6    6  12  18  24  30  36  42  48  54   60
7    7  14  21  28  35  42  49  56  63   70
8    8  16  24  32  40  48  56  64  72   80
9    9  18  27  36  45  54  63  72  81   90
10  10  20  30  40  50  60  70  80  90  100

In [62]:
spreads = ['butter', 'jam', 'peanut butter']
toppings = ['ham', 'cheese', 'sardines']
mixins = []
sandwiches = {}
for spread in spreads:
    for topping in toppings:
        mixins.append(f'{spread} {topping}')

    sandwiches[spread] = mixins
    mixins = []               
print(sandwiches)

combinations_df = pd.DataFrame(sandwiches)
combinations_df['topping'] = toppings
combinations_df.set_index('topping', inplace=True)

combinations_df

# combinations_df = combinations_df[('toppings', 'butter', 'jam', 'peanut butter')]
# combinations_df

{'butter': ['butter ham', 'butter cheese', 'butter sardines'], 'jam': ['jam ham', 'jam cheese', 'jam sardines'], 'peanut butter': ['peanut butter ham', 'peanut butter cheese', 'peanut butter sardines']}

                   butter           jam           peanut butter
topping
ham            butter ham       jam ham       peanut butter ham
cheese      butter cheese    jam cheese    peanut butter cheese
sardines  butter sardines  jam sardines  peanut butter sardines

In [26]:
for i in range(1,6):
    for j in range(1, 4):
        print('*', end=' ')
    print(' ')

* * *
* * *
* * *
* * *
* * *

In [48]:
import pandas as pd
final = []
answers = {}
for i in list(range(2,11)):
    for j in list(range(2,11)):
        final.append(i**j)
    answers[i] = final
    final = []

combinations_df = pd.DataFrame(answers)
combinations_df.index += 2
combinations_df

,2,3,4,5,6,7,8,9,10
2,4,9,16,25,36,49,64,81,100
3,8,27,64,125,216,343,512,729,1000
4,16,81,256,625,1296,2401,4096,6561,10000
5,32,243,1024,3125,7776,16807,32768,59049,100000
6,64,729,4096,15625,46656,117649,262144,531441,1000000
7,128,2187,16384,78125,279936,823543,2097152,4782969,10000000
8,256,6561,65536,390625,1679616,5764801,16777216,43046721,100000000
9,512,19683,262144,1953125,10077696,40353607,134217728,387420489,1000000000
10,1024,59049,1048576,9765625,60466176,282475249,1073741824,3486784401,10000000000

In [31]:
import pandas as pd
import statistics as stat
#import os module to read in files from local directory
house_prices = []
df = pd.read_csv('/workspaces/ERN-sessions/data/1980 2023 average house prices.csv')
df['Period'] = pd.to_datetime(df['Period'], format='%Y-%m', dayfirst=True)
max = df['Average price All property types'].max()
min = df['Average price All property types'].min()
mean = df['Average price All property types'].mean()
median = df['Average price All property types'].median()
# house_prices.append(max_house_price)
# house_prices.append(min_house_price)
# house_prices.append(mean_house_price)
# house_prices.append(median_house_price)
house_info_list = [max, min, mean, median]
house_str = ['max', 'min', 'mean', 'median']
for i in range(0,4):
    print(f'{house_str[i]}: {house_info_list[i]}')

max: 292187
min: 19273
mean: 120570.55831739961
median: 97964.0

In [34]:
print((2 > 3) & (4 == 4)) # AND statement
print((2 > 3) | (4 == 4)) # OR statement

False
True

In [36]:
df_under_mean = df[df['Average price All property types'] < df['Average price All property types'].median()]
df_under_mean

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
254,United Kingdom,2001-03-01,48.85,93136,-0.52,10.06
255,United Kingdom,2001-04-01,50.61,96499,3.61,8.15
256,United Kingdom,2001-05-01,50.61,96499,3.61,8.15
257,United Kingdom,2001-06-01,50.61,96499,3.61,8.15
264,United Kingdom,2002-01-01,51.20,97623,-0.35,4.82

In [ ]:
df_under_mean_median = df[(df['Average price All property types'] < df['Average price All property types'].mean()) &
(df['Average price All property types'] < (df['Average price All property types'].median()))]
df_under_mean_median

In [ ]:
over_mean = df['Average price All property types'] > df['Average price All property types'].mean()
under_median = df['Average price All property types'] < df['Average price All property types'].median()
print(over_mean)
print(under_median)

condition = over_mean | under_median
df_over_under = df[condition]
print(df_over_under)

In [ ]:
mean_monthly_percent = df['Percentage change (monthly) All property types'] < df['Percentage change (monthly) All property types'].mean()
median_annual_percent = df['Percentage change (yearly) All property types'] < df['Percentage change (yearly) All property types'].median()
condition = mean_monthly_percent & median_annual_percent
df_mean_median_under = df[condition]
df_mean_median_under

In [53]:
df = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                   'Age first contact':[6,12,11,1,19],
                   'Gender':['M','m', 'F', '', 'F' ],
                   'Birthday':['01/01/2002', '02/02/2003', pd.NA, '03/03/2023', '06/01/2012'],
                   'Age':[5,12,11,6,2],
                   'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})
df['Birthday'] = pd.to_datetime(df['Birthday'], dayfirst=True)
age_error = df['Age first contact'] > df['Age']
CP_Plan_Y = df['CP Plan?'].str.lower().str.contains('y')
# condition = age_error & CP_Plan_Y
# cohort = df[condition]
age_error_cp_plan = df[age_error & CP_Plan_Y]
age_error_cp_plan

  ChildId  Age first contact Gender   Birthday  Age CP Plan?
0     id1                  6      M 2002-01-01    5        Y
4     id5                 19      F 2012-01-06    2      yES

In [ ]:
#if
#else
#elif

if (1 < 2) == True:
    print('true')
else:
    print('false')

In [ ]:
list_nums = list(range(1, 21))
for number in list_nums:
    if number %2 == 0: # Note: %x = modulus sign
        print(f'{number} is even')  
    else:
        print(f'{number} is odd')

In [62]:
new_nums = range(0,21)
evens = []
odds = []
for number in new_nums:
    if (number != 0) & (number %2 == 0):
        evens.append(number)
        print(f'{number} is not equal to zero and is even')

    elif (number != 0) & (number %2 != 0):
        odds.append(number)
        print(f'{number} is not equal to zero and is odd')
        
    else:
        print(f'{number} is zero')
print(f'Even numbers are: {evens}')
print(f'Odd numbers are: {odds}')

0 is zero
1 is not equal to zero and is odd
2 is not equal to zero and is even
3 is not equal to zero and is odd
4 is not equal to zero and is even
5 is not equal to zero and is odd
6 is not equal to zero and is even
7 is not equal to zero and is odd
8 is not equal to zero and is even
9 is not equal to zero and is odd
10 is not equal to zero and is even
11 is not equal to zero and is odd
12 is not equal to zero and is even
13 is not equal to zero and is odd
14 is not equal to zero and is even
15 is not equal to zero and is odd
16 is not equal to zero and is even
17 is not equal to zero and is odd
18 is not equal to zero and is even
19 is not equal to zero and is odd
20 is not equal to zero and is even
Even numbers are: [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
Odd numbers are: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19]